Tekla Open API Reference for Tekla Structures 2025
MainWindow.Handle Property
 Gets the handle.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
Implements
IWin32Window.Handle
See Also
Reference
MainWindow Class
Tekla.Structures.Dialog Namespace